# 1. 산술연산  2*10    2+10
# 2. 관계연산 1>2 'asd' == 'asd' 20<20+10
# 3. 논리연산 10 >2 or 2 < 10
# 4. 비트연산 10 | 2 ( or -> | , and ->&


# 사칙연산
print(2 * 3)
print(2 + 3)
print(2 - 3)
print(2 / 3)
print(2 / 3.0)
print(2.0 / 3.0)

# //(몫연산자) , **(지수승), %(나머지 연산자)
print(2 // 3)
print(2 ** 3)
print(2 % 3)

# divomod() 함수
t = divmod(2,3)
print(t, type(t))


# 산술 연산자 우선순위
# + , - (단항 연산자)
# **
# *, / , % , //
# x , - (이항 연산자 , 더하기/빼기)
print(2 + 3 * 4)
print(-(2 + 3) * 4)

# 결합순서
print(2** 3 ** 4)
print(2 ** (3 ** 4))
print((2 **3) ** 4)

